leetcode_217_contains_duplicate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 217. Contains Duplicate</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 217. Contains Duplicate</h1>
<p>
<a href="https://leetcode.com/problems/contains-duplicate/description/">Problem Statement</a>
</p>

<div id="outline-container-orgfead744" class="outline-2">
<h2 id="orgfead744">Patterns</h2>
<div class="outline-text-2" id="text-orgfead744">
<ul class="org-ul">
<li><a href="pattern_searching_in_array.html#ID-12D16A10-EB7A-4EF8-A0E8-91B5EE694582">Pattern: Searching in Array</a></li>
<li><a href="pattern_problem_s_constraints_disallow_o_n_2_solutions.html#ID-FCF0DB21-F99D-4A98-B592-6889DB9FE1F4">Pattern: Problem's constraints disallow \(O(n^2)\) solutions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org70d69eb" class="outline-2">
<h2 id="org70d69eb">Solution</h2>
<div class="outline-text-2" id="text-org70d69eb">
<p>
Given an array of integers, determine if there are any duplicate integers.  We can use a set to store the distinct numbers of the array.  If the length of the set is equal to \(n\), then all numbers are distinct and the answer is \(false\).  Otherwise, the answer is \(true\) since there is at least one duplicate integer in the array.  The time and space complexity is \(O(n)\) as all numbers to the set.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">containsDuplicate</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">bool</span>:
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(nums) &gt; <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">set</span>(nums))
</pre>
</div>

<p>
Alternatively, the problem can be solved as a search problem.  For each integer \(i\), search \(a[i]\) in \(a[0...(i-1)]\) returning \(true\) if it is found.  If the search failed for all integers, then the answer is \(false\) since all integers are distinct.  A linear search does not consume extra memory, but it is too slow for the problem's constraints.  We can sort the array what makes the search trivial as \(a[i]\) needs to be only checked against \(a[i-1]\) to determine if it is duplicated or not.  The time complexity of this solution is \(O(n \log n)\).  Other approach is to use extra memory: <a href="binary_search_tree.html#ID-84CF1D07-B0AD-4BC1-9A20-D2565CD9FFBD">Binary Search Tree</a> or <a href="hash_table.html#ID-0573B9FD-E008-400B-B6B7-75F5E54994E2">Hash Table</a>.  The former supports insertion and look up in \(O(\log n)\) resulting in the same time complexity as sorting the array, while the latter supports the same operation in \(O(1)\) resulting in same time complexity as counting the number of distinct integers.
</p>
</div>
</div>


<div id="outline-container-org295cff7" class="outline-2">
<h2 id="org295cff7">Cited by 1</h2>
<div class="outline-text-2" id="text-org295cff7">
<ul class="org-ul">
<li><a href="interview_preparation_v.html#ID-8C7E9E52-9220-4A7B-B0E6-54F960E17CA8">Interview preparation: V</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>